# unicode编码---------------------------------------------------------------------------
# chr()
# 括号内填写Unicode编码，返回此编码的字符
import math

print(chr(65))  # A
# ord()
# 返回指定字符的Unicode编码
print(ord('B'))  # 66
# 进制转换------------------------------------------------------------------------------
# hex()、int()、oct()、bin()
# hex将整数转换为十六进制，返回其小写字符串形式
# int十进制,otc八进制,bin二进制
print(hex(25), oct(0b11001), bin(0x19))  # 0x19 0o31 0b11001
print(int('0x19', 0), int('0o31', 8), int('11001', 2))  # 25 25 25参数填0会自动识别进制(此时需要加上前缀0x/0o/0b)
print(int('13', 7))  # 10, 七进制的13=十进制的10
# 判断是否为整数-----------------
x = 5.0
if isinstance(x, int):  # 对浮点数无法判断
    print("x是整数1")
if str(x).isdigit():#对浮点数无法判断
    print("x是整数2")

#if math.isqrt(x)**2 == x:#浮点数不能参与开方报错
if x % 1 == 0:
    print("x是整数")

