"""
center居中对齐、ljust左对齐、rjust右对齐（zfill，用0填充的右对齐）
split劈分、sep指定劈分符、maxsplit最大劈分次数、rsplit从右开始劈分
字符判断:isidentifier合法标识符（字母数字下划线）、isspace空白字符（回车换行水平制表符）、isalpha字母字符（zm，汉字为字母）
        isdecimal十进制数字（阿拉伯数字，非小数）、isnumeric数字（汉字数、罗马数也算）、isalnum字母数字
replace替换
join加入
"""
# 创建字符
a = "绝迹" + "的星"  # '+'可加可不加
x = '☆' * 4  # x='☆☆☆☆'
# -----------------------------------------------------------------------
# 对齐输出
b = a.center(18, "☆")  # (宽度,填充符),居中对齐
c = a.ljust(18, '☆')  # 左对齐
d = a.rjust(18, '☆')  # 右对齐
print(b)
b = "☆☆☆☆☆☆☆绝迹的星☆☆☆☆☆☆☆"
# -----------------------------------------------------------------------
# 劈分
e = b.split("☆")
print(e)
e = ['', '', '', '', '', '', '', '绝迹的星', '', '', '', '', '', '', '']
# -----------------------------------------------------------------------
# 判断
print(a.isidentifier())  # True
print('a' in 'abcd')  # True
# -----------------------------------------------------------------------
# replace
f = b.replace("☆", "★", 7)  # (原字符,替换字符,次数)
print(f)
f = "★★★★★★★绝迹的星☆☆☆☆☆☆☆"
# len
print(len(f))  # 长度为18
# -----------------------------------------------------------------------
# 特殊字符连接
g = ['joker', 'xue']
h = 'jokerxue'
print('\\'.join(g))  # joker\xue
print('-'.join(h))  # j-o-k-e-r-x-u-e

# -----------------------------------------------------------------------
# 判断
s = 'a612sd'
print(s.isdigit())  # 判断是否全为数字,这里输出为False
'''
isidentifier() 合法标识符 字母数字下划线
isdecimal() 十进制数 阿拉伯数字,非小数
isnumeric() 数字 汉字数、罗马数也算
isdigit() 十进制数 0--9
isxdigit() 十六进制数 0--9,a—f,或A--F
isalnum() 字母数字符号 0--9,a--Z,或A--Z
isalpha() 字母 a--Z或A--Z
islower() 小写字母 a--Z
isupper() 大写字母 A--Z
isspace() 空白符 空格符,水平制表符,垂直制表符,换行符,换页符,或回车符
isgraph() 非空白字符 任何打印出来不是空白的字符(ASCII码从21到7E)
isprint() 可打印字符 所有非空白字符,加上空格符
ispunct() 标点符 除字母数字符号以外的所有非空白字符
iscntrl() 控制字符 除可打印字符外的所有字符(ASCII码从00到1F,加上7F)
'''